//----------------------------------------------------------------------------
// 2025/1학기 STL
//----------------------------------------------------------------------------
//	STL container - Containers are objects that store other objects.
//----------------------------------------------------------------------------
#include<iostream>
#include"save.h"
#include"STRING.h"
using namespace std;
//----------------------------------------------------------------------------
#include<vector>

//----------------------------------------------------------------------------

extern bool 관찰;


// [문제] 키보드에서 단어를 입력받아 오름차순으로 정렬 후 출력하라
int main() {
	관찰 = true;
	vector<STRING> v;
	
	v.emplace_back( "12345" );
	
	save("main.cpp");
}