//----------------------------------------------------------------------------
// 2025/1학기 STL
// 3.10 월요일	(1주차 2일)
//----------------------------------------------------------------------------
// 많은 수의 자료 다루기 - int -> Dog
//----------------------------------------------------------------------------
#include<iostream>
#include"save.h"

#include<fstream>

// [문제] "int 1000개.txt"파일에서 가장  큰 값을 찾아 화면에 출력하라
//출력된 값도 답지에 적어라
int main() {
	std::ifstream in{ "int 1000개.txt" };
	if (not in) {
		std::cout << "파일을 찾지 못했습니다.\n";
	}


	save("main.cpp");

}

