//----------------------------------------------------------------------------
// 2025/1학기 STL
//----------------------------------------------------------------------------
// class STRING 작성 시작 - STL의 표준 컨테이너가 되도록 발전 시킨다
//							벡터의 동작을 진짜 자세히 이해한다
//----------------------------------------------------------------------------
#include<iostream>
#include"save.h"
#include"STRING.h"
using namespace std;
//----------------------------------------------------------------------------
#include<string>
#include<memory>
//----------------------------------------------------------------------------


//다음시간 관찰 메시지 해석
STRING x{ "수업시간이너무짧아" };

int main() {

	STRING s{ "nanananananan" };

	STRING t;
	STRING u = s;

	save("main.cpp");
}