//----------------------------------------------------------------------------
// 2025 / 1학기 STL
// 6/19 목요일 15주2일 - 기말시험
//----------------------------------------------------------------------------
// 반복자와 알고리즘
// find
// find_if
// copy
//----------------------------------------------------------------------------
#include<iostream>
#include"save.h"
#include"STRING.h"
using namespace std;
//----------------------------------------------------------------------------
#include<algorithm>
#include<vector>
//----------------------------------------------------------------------------

extern bool 관찰;

int main() {
	STRING s("2025. 5. 26");
	
	vector<char> v;
	
	// [문제] s가 관리하는 문자들을 v에 복사하라
	
	//copy(s.begin(), s.end(), v.begin());
	

	//save("main.cpp");
}
